In [1]:
#importing Necessary Libararies
import pandas as pd
import numpy as np
import selenium
from selenium import webdriver
from selenium.webdriver.common.by import By 
import time
import warnings
warnings.filterwarnings('ignore')

# Q1: In this question you have to scrape data using the filters available on the webpage You have to use the location and salary filter.

In [12]:
driver=webdriver.Chrome()

In [13]:
#get the website
driver.get('https://www.naukri.com/')

In [15]:
# filling Job title - Data Scientist
designation=driver.find_element(By.CLASS_NAME,"suggestor-input ")
designation.send_keys('Data Scientist')

In [18]:
# Click Search  
search=driver.find_element(By.CLASS_NAME,"qsbSubmit")
search.click()

In [24]:
# filter
Delhi_NCR=driver.find_element(By.XPATH,'/html/body/div/div/main/div[1]/div[1]/div/div/div[2]/div[2]/div[2]/div[2]/label/p/span[1]').click()

In [26]:
Salary_Filter=driver.find_element(By.XPATH,'/html/body/div/div/main/div[1]/div[1]/div/div/div[2]/div[2]/div[2]/div[2]/label/p/span[1]').click()

In [28]:
job_title=[]
job_location=[]
company_name=[]
experience_required=[]

title_tags=driver.find_elements(By.XPATH,'//a[@class="title "]')
for i in title_tags:
    title=i.text
    job_title.append(title)

loc_tags=driver.find_elements(By.XPATH,'//span[@class="loc-wrap ver-line"]')
for i in loc_tags:
    location=i.text
    job_location.append(location)

comp_tags=driver.find_elements(By.XPATH,'//div[@class=" row2"]')
for i in comp_tags:
    company=i.text
    company_name.append(company)

exp_tags=driver.find_elements(By.XPATH,'//span[@class="exp-wrap"]')
for i in exp_tags:
    experience=i.text
    experience_required.append(experience)

In [29]:
print(len(job_title),len(job_location),len(company_name),len(experience_required))

25 25 25 25

In [33]:
Naukri_dot_com=pd.DataFrame({'Job Titles':job_title,'Locations':job_location,'Comapany Names':company_name,'Experiences':experience_required})
Naukri_dot_com.head(10)

,Job Titles,Locations,Comapany Names,Experiences
0,Data Scientist (AI/ML)|| US Based MNC || Noida,Hybrid - Noida,US based Software Company\nPosted by Bean Hr C...,3-5 Yrs
1,Data Scientist,Ghaziabad,Biz Tech Consultants\n3.5\n3 Reviews,3-8 Yrs
2,Data Scientist: Artificial Intelligence,Gurugram,IBM\n4.1\n20413 Reviews,3-7 Yrs
3,Data Analyst,Delhi / NCR,InsurTech Unicorn,1-4 Yrs
4,Data Analyst,,E-Commerce Unicorn,1-4 Yrs
5,,,,
6,,,,
7,,,,
8,Data Analyst & Data Scientist,Gurugram,Varuna Integrated Logistics\n3.7\n360 Reviews,3-8 Yrs
9,Data Scientist,Gurugram,Collegedunia\n2.9\n505 Reviews,0-2 Yrs

# Q2: Write a python program to scrape data for “Data Scientist” Job position in “Bangalore” location. You have to scrape the job-title, job-location, company_name, experience_required. You have to scrape first 10 jobs data.

In [2]:
driver=webdriver.Chrome()

In [3]:
driver.get('https://www.shine.com/')

In [4]:
job=driver.find_element(By.CLASS_NAME,"form-control  ")
job.send_keys('Data Scientitst')

loc= driver.find_element(By.XPATH,'/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[2]/div/input')
loc.send_keys('Bengaluru')

In [8]:
search=driver.find_element(By.CLASS_NAME,"searchForm_btnWrap_advance__VYBHN")
search.click()

In [9]:
# first 10 jobs 
job_title=[]
job_location=[]
company_name=[]
experience_required=[]

title_tags=driver.find_elements(By.XPATH,'//strong[@class="jobCard_pReplaceH2__xWmHg"]')
for i in title_tags:
    title=i.text
    job_title.append(title)

loc_tags=driver.find_elements(By.XPATH,'//div[@class="jobCard_jobCard_lists_item__YxRkV jobCard_locationIcon__zrWt2"]')
for i in loc_tags:
    location=i.text
    job_location.append(location)

comp_tags=driver.find_elements(By.XPATH,'//div[@class="jobCard_jobCard_cName__mYnow"]')
for i in comp_tags:
    company=i.text
    company_name.append(company)

exp_tags=driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_jobIcon__3FB1t"]')
for i in exp_tags:
    experience=i.text
    experience_required.append(experience)

In [10]:
print(len(job_title),len(job_location),len(company_name),len(experience_required))

20 20 20 20

In [12]:
#DataFrame
Shine_dot_com=pd.DataFrame({'Job Titles':job_title,'Locations':job_location,'Comapany Names':company_name,'Experiences':experience_required})
Shine_dot_com.head(10)

             Job Titles      Locations           Comapany Names Experiences
0    Data Entry Officer  Bangalore\n+9  v-tech data outsourcing   0 to 1 Yr
1         Data Operator  Bangalore\n+9  v-tech data outsourcing   0 to 1 Yr
2   Data Entry Operator  Bangalore\n+9  v-tech data outsourcing   0 to 1 Yr
3    Data Entry Officer  Bangalore\n+9  v-tech data outsourcing   0 to 1 Yr
4         Data Operator  Bangalore\n+9  v-tech data outsourcing   0 to 1 Yr
5         Data Operator  Bangalore\n+9  v-tech data outsourcing   0 to 1 Yr
6         Data Operator  Bangalore\n+9  v-tech data outsourcing   0 to 1 Yr
7  Data Entry Executive  Bangalore\n+9  v-tech data outsourcing   0 to 1 Yr
8         Data Operator  Bangalore\n+9  v-tech data outsourcing   0 to 1 Yr
9    Data Entry Officer  Bangalore\n+9  v-tech data outsourcing   0 to 1 Yr

# Q3: Scrape 100 reviews data from flipkart.com for iphone11 phone. You have to go the link:

In [2]:
driver=webdriver.Chrome()

In [3]:
driver.get("https://www.flipkart.com/apple-iphone-11-black-64-gb/product-reviews/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYZXSHRJ&marketplace=FLIPKART")

In [24]:
#ratings
rating=[]
start=0
end=10
for page in range(start,end):
    rates=driver.find_elements(By.XPATH,'//div[@class="XQDdHH Ga3i8K"]')
    for i in rates:
        rating.append(i.text)
    next_button=driver.find_elements(By.XPATH,'/html/body/div/div/div[3]/div/div/div[2]/div[3]/div/div/div/div[1]/div')
    if next_button:
        next_button[0].click()
    time.sleep(10)

In [25]:
print(len(rating))

100

In [4]:
# Review summary
summary=[]
start=0
end=10
for page in range(start,end):
    summ=driver.find_elements(By.XPATH,'//p[@class="z9E0IG"]')
    for i in summ:
        summary.append(i.text)
    next_button=driver.find_elements(By.XPATH,'/html/body/div/div/div[3]/div/div[1]/div[2]/div[3]/div/div/div/div[1]/p')
    if next_button:
        next_button[0].click()
    time.sleep(10)

In [5]:
print(len(summary))

100

In [6]:
# Full review
full_rev=[]
start=0
end=10
for page in range(start,end):
    full=driver.find_elements(By.XPATH,'//div[@class="ZmyHeo"]')
    for i in full:
        full_rev.append(i.text)
    next_button=driver.find_elements(By.XPATH,'/html/body/div/div/div[3]/div/div/div[2]/div[3]/div/div/div/div[2]/div')
    if next_button:
        next_button[0].click()
    time.sleep(10)

In [7]:
print(len(full_rev))

100

# Q4: Scrape data forfirst 100 sneakers you find whenyouvisitflipkart.com and search for “sneakers” inthe search field.

In [20]:
driver=webdriver.Chrome()

In [24]:
driver.get("""https://www.flipkart.com/apple-iphone-11-black-64-gb/product-
reviews/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYZXSHRJ&marketplace=F

LIPKART""")

In [25]:
sneakers=driver.find_element(By.CLASS_NAME,"zDPmFV")
sneakers.send_keys('Sneakers')

In [26]:
search=driver.find_element(By.CLASS_NAME,"MJG8Up")
search.click()

In [31]:
assured=driver.find_element(By.XPATH,'/html/body/div/div/div[3]/div[1]/div[1]/div/div/div/section[3]/label/div[2]')
assured.click()

In [32]:
# Brand
brand=[]
start=0
end=3
for page in range(start,end):
    b=driver.find_elements(By.XPATH,'//div[@class="syl9yP"]')
    for i in b:
        brand.append(i.text)
    next_button=driver.find_element(By.XPATH,'/html/body/div/div/div[3]/div/div[2]/div[2]/div/div[1]/div/div/div[2]')
    next_button.click()
    time.sleep(3)

In [33]:
print(len(brand[:100]))

100

In [36]:
# Product description
product=[]
start=0
end=3
for page in range(start,end):
    p=driver.find_elements(By.XPATH,'//a[@class="WKTcLC"]')
    for i in p:
        product.append(i.text)
    next_button=driver.find_element(By.XPATH,'/html/body/div/div/div[3]/div/div[2]/div[2]/div/div[1]/div/div/a[1]')
    next_button.click()
    time.sleep(3)

In [38]:
print(len(product[:100]))

100

In [39]:
# Price
Price=[]
start=0
end=3
for page in range(start,end):
    Prices=driver.find_elements(By.XPATH,'//div[@class="Nx9bqj"]')
    for i in Prices:
        Price.append(i.text)
    next_button=driver.find_element(By.XPATH,'/html/body/div/div/div[3]/div/div[2]/div[2]/div/div[1]/div/div/a[2]/div/div[1]')
    next_button.click()
    time.sleep(3)

In [40]:
print(len(Price[:100]))

100

# Q5: Go to webpage https://www.amazon.in/ Enter “Laptop” in the search field and then click the search icon. Then set CPU Type filter to “Intel Core i7” as shown in the below image:

In [50]:
#web driver
driver=webdriver.Chrome()

In [51]:
#opening the webside for scrape
driver.get('https://www.amazon.in/')

In [64]:
Lap=driver.find_element(By.XPATH,'//input[@type="text"]')
Lap.send_keys("Laptop")

In [66]:
search=driver.find_element(By.XPATH,'/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[3]/div/span/input')
search.click()

In [67]:
intel=driver.find_element(By.XPATH,'/html/body/div[1]/div[1]/div[1]/div[2]/div/div[3]/span/div[1]/span/div/div/div[6]/ul[2]/span/span[8]/li/span/a')
intel.click()

In [79]:
# title
title=[]
title_tags=driver.find_elements(By.XPATH,'//span[@class="a-size-medium a-color-base a-text-normal"]')
for i in title_tags:
    titles=i.text
    title.append(titles)

rating=[]
rating_tags=driver.find_elements(By.XPATH,'//span[@class="a-size-base s-underline-text"]')
for i in rating_tags:
    rate=i.text
    rating.append(rate)

Price=[]
p_tags=driver.find_elements(By.XPATH,'//span[@class="a-price-whole"]')
for i in p_tags:
    p=i.text
    Price.append(p)

In [76]:
pd.DataFrame(title[:10])

                                                   0
0  HP Laptop 15s, 12th Gen Intel Core i7-1255U, 1...
1  HP Pavilion 14 12th Gen Intel Core i7 16GB SDR...
2  (Refurbished) Dell Latitude 7480 14in FHD Lapt...
3  WALKENT Stylish 15.6" Laptop Bag, Premium Leat...
4  Acer ALG 13th Gen Intel Core i7 Gaming Laptop ...
5  ASUS Vivobook 15, 15.6" (39.62cm) FHD, Intel C...
6  Dell [Smartchoice] Inspiron 5430 Thin & Light ...
7  Acer Travelmate Business Laptop Intel Core i7-...
8  Acer Aspire Lite 12th Gen Intel Core i7-1255U ...
9  Dell Inspiron 3530 Laptop, 13th Generation Int...

In [81]:
pd.DataFrame(rating[:10])

     0
0   71
1  755
2  743
3  332
4   22
5  120
6   16
7   18
8    9
9   40

In [82]:
pd.DataFrame(Price[:10])

        0
0  59,990
1  76,990
2  26,494
3   2,990
4  71,990
5  61,990
6  80,990
7  44,990
8  49,990
9  69,920

# Q6: Write a python program to scrape data for Top 1000 Quotes of All Time. The above task will be done in following steps:

In [2]:
#web driver
driver=webdriver.Chrome()

In [3]:
#opening the webside for scrape
driver.get('https://www.azquotes.com/')

In [4]:
top=driver.find_element(By.XPATH,'//a[@href="/top_quotes.html"]')
top.click()

In [26]:
# quote
quote=[]
start=0
end=10
for page in range(start,end):
    q=driver.find_elements(By.XPATH,'//div[@class="wrap-block"]')
    for i in q:
        quote.append(i.text)
    next_button=driver.find_element(By.XPATH,'/html/body/div[1]/div[2]/div/div/div/div[1]/div/ul/li[1]/div')
    next_button.click()
    time.sleep(3)

In [27]:
print(len(quote))

1000

In [34]:
Author=[]
start=0
end=10
for page in range(start,end):
    a=driver.find_elements(By.XPATH,'//div[@class="author"]')
    for i in a:
        Author.append(i.text)
    next_button=driver.find_element(By.XPATH,'/html/body/div[1]/div[2]/div/div/div/div[1]/div/ul/li[1]/div/div[1]')
    next_button.click()
    time.sleep(3)

In [35]:
print(len(Author))

1000

In [ ]:
# type of Quotes
t_o_q=[]
start=0
end=10
for page in range(start,end):
    t=driver.find_elements(By.XPATH,'//div[@class="tags"]')
    for i in t:
        t_o_q.append(i.text)
    next_button=driver.find_element(By.XPATH,'/html/body/div[1]/div[2]/div/div/div/div[1]/div/ul/li[1]/div/div[2]/div[1]')
    next_button.click()
    time.sleep(3)

# Q7: Write a python program to display list of respected former Prime Ministers of India (i.e. Name, Born-Dead, Term of office, Remarks) from https://www.jagranjosh.com/general-knowledge/list-of- all-prime-ministers-of-india-1473165149-1 scrap the mentioned data and make the DataFrame

In [56]:
driver=webdriver.Chrome()

In [57]:
driver.get("""https://www.jagranjosh.com/general-knowledge/list-of-
all-prime-ministers-of-india-1473165149-1""")

In [55]:
names=[]
Age_when_assumed_office=[]
Term_of_office=[]
Duration=[]

# Q8: Write a python program to display list of 50 Most expensive cars in the world (i.e. Car name and Price) from https://www.motor1.com/

In [86]:
driver=webdriver.Chrome()

In [87]:
driver.get('https://www.motor1.com/')

In [89]:
car=driver.find_element(By.XPATH,'/html/body/div[9]/div[2]/div/div/div[3]/div/div/div/form/input')
car.send_keys('50 most expensive cars')

In [90]:
search=driver.find_element(By.XPATH,'/html/body/div[9]/div[2]/div/div/div[3]/div/div/div/form/button[1]')
search.click()

In [91]:
press=driver.find_element(By.CLASS_NAME,"text-box")
press.click()

In [92]:
cars=[]
car_tags=driver.find_elements(By.XPATH,'//h3[@class="subheader"]')
for i in car_tags:
    c=i.text
    cars.append(i.text)

In [94]:
Data=pd.DataFrame({'Top 50 Expensive Cars':cars})
Data

                        Top 50 Expensive Cars
0                           McLaren Senna GTR
1                                 Czinger 21C
2                               Ferrari Monza
3                          Gordon Murray T.33
4                           Koenigsegg Gemera
5                          Hennessey Venom F5
6                             Bentley Bacalar
7               Hispano Suiza Carmen Boulogne
8                      Bentley Mulliner Batur
9                                 SSC Tuatara
10                                Lotus Evija
11                        Aston Martin Vulcan
12                                 Delage D12
13                        Ferrari Daytona SP3
14                          McLaren Speedtail
15                               Rimac Nevera
16                              Pagani Utopia
17                       Pininfarina Battista
18                         Gordon Murray T.50
19                       Lamborghini Countach
20              Hennessey Venom F5 Revolution
21                   Mercedes-AMG Project One
22                               Zenvo Aurora
23                        Aston Martin Victor
24                Hennessey Venom F5 Roadster
25                           Koenigsegg Jesko
26                                 Aspark Owl
27                      Aston Martin Valkyrie
28                  W Motors Lykan Hypersport
29                              McLaren Solus
30                        Pagani Huayra Evo R
31                           Lamborghini Sian
32                           Koenigsegg CC850
33            Bugatti Chiron Super Sport 300+
34  Gordon Murray Automotive T.50s Niki Lauda
35                  Pagani Huayra Roadster BC
36                         Lamborghini Veneno
37                             Bugatti Bolide
38                  Pininfarina B95 Speedster
39                            Bugatti Mistral
40                               Bugatti Divo
41                        Pagani Huayra Imola
42                           Pagani Codalunga
43                   Mercedes-Maybach Exelero
44                         Bugatti Centodieci
45                    Bugatti Chiron Profilée
46                       Rolls-Royce Sweptail
47                   Bugatti La Voiture Noire
48                      Rolls-Royce Boat Tail
49         Rolls-Royce La Rose Noire Droptail
50           Most Expensive Cars In The World